m-okada/QV08/emu/ARM/kinetis_workspace/t03/SDK/platform/drivers/src/edma/fsl_edma_driver.c
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdlib.h>
#include <string.h>
#include "fsl_edma_driver.h"
#include "fsl_clock_manager.h"
#include "fsl_interrupt_manager.h"
#if FSL_FEATURE_SOC_EDMA_COUNT

/*******************************************************************************
 * Variabled
 ******************************************************************************/
/*! @brief EDMA global structure to maintain EDMA resource */
edma_state_t *g_edma = NULL;

/*******************************************************************************
 * PROTOTYPES
 ******************************************************************************/
static edma_status_t EDMA_DRV_ClaimChannel(
                uint8_t channel, dma_request_source_t source, edma_chn_state_t *chn);
static void EDMA_DRV_ClearIntStatus(uint8_t channel);

/*! @brief Macro for EDMA driver lock mechanism. */
#if (USE_RTOS)
    #define EDMA_DRV_LOCK()         OSA_MutexLock(&g_edma->lock, OSA_WAIT_FOREVER)
    #define EDMA_DRV_UNLOCK()       OSA_MutexUnlock(&g_edma->lock)
#else
    #define EDMA_DRV_LOCK()         do {}while(0)
    #define EDMA_DRV_UNLOCK()       do {}while(0)
#endif

/*******************************************************************************
 * Code
 ******************************************************************************/
/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_Init
 * Description   : Initializes all eDMA modules in SOC.
 *
 *END**************************************************************************/
edma_status_t EDMA_DRV_Init(edma_state_t *edmaState, const edma_user_config_t *userConfig)
{
    uint32_t i, j;
    DMA_Type * edmaRegBase;
    DMAMUX_Type * dmamuxRegBase;
    IRQn_Type irqNumber;

    if (g_edma)
    {
        return kStatus_EDMA_Success;
    }

    g_edma = edmaState;
    memset(g_edma, 0, sizeof(edma_state_t));
#if (USE_RTOS)
    /* Init mutex object for the access control of edma data structure. */
    OSA_MutexCreate(&g_edma->lock);
#endif

    for (i = 0; i < DMA_INSTANCE_COUNT; i++)
    {
        edmaRegBase = g_edmaBase[i];
        /* Enable clock gate of eDMA module. */
        CLOCK_SYS_EnableDmaClock(i);

        /* Init eDMA module in hardware level. */
        EDMA_HAL_Init(edmaRegBase);

        EDMA_HAL_SetChannelArbitrationMode(edmaRegBase, userConfig->chnArbitration);
#if (FSL_FEATURE_EDMA_CHANNEL_GROUP_COUNT > 0x1U)
        EDMA_HAL_SetGroupArbitrationMode(edmaRegBase, userConfig->groupArbitration);
        EDMA_HAL_SetGroupPriority(edmaRegBase, userConfig->groupPriority);
#endif
        EDMA_HAL_SetHaltOnErrorCmd(edmaRegBase, !userConfig->notHaltOnError);

#if defined FSL_FEATURE_EDMA_HAS_ERROR_IRQ
        /* Enable the error interrupt for eDMA module. */
        irqNumber = g_edmaErrIrqId[i];
        INT_SYS_EnableIRQ(irqNumber);
#endif

        /* Register all edma channl interrupt handler into vector table. */
        for (j = 0; j < FSL_FEATURE_EDMA_MODULE_CHANNEL; j++)
        {
            /* Enable channel interrupt ID. */
            irqNumber = g_edmaIrqId[i][j];
            INT_SYS_EnableIRQ(irqNumber);
        }
    }

    for (i = 0; i < DMAMUX_INSTANCE_COUNT; i++)
    {
        dmamuxRegBase = g_dmamuxBase[i];
        /* Enable dmamux clock gate */
        CLOCK_SYS_EnableDmamuxClock(i);

        /* Init dmamux module in hardware level */
        DMAMUX_HAL_Init(dmamuxRegBase);
    }

    return kStatus_EDMA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_Deinit
 * Description   : Deinitilize EDMA.
 *
 *END**************************************************************************/
edma_status_t EDMA_DRV_Deinit(void)
{
    uint32_t i, j;
    IRQn_Type irqNumber;
    edma_chn_state_t *chn;

    /* Release all edma channel. */
    for (i = 0; i < DMA_INSTANCE_COUNT; i++)
    {
#if defined FSL_FEATURE_EDMA_HAS_ERROR_IRQ
        /* Disable the error interrupt for eDMA module. */
        irqNumber = g_edmaErrIrqId[i];
        INT_SYS_DisableIRQ(irqNumber);
#endif

        for (j = i * FSL_FEATURE_EDMA_MODULE_CHANNEL; j < (i + 1) * FSL_FEATURE_EDMA_MODULE_CHANNEL; j++)
        {
            /* Release all channel. */
            chn = g_edma->chn[j];
            if (chn)
            {
                EDMA_DRV_ReleaseChannel(chn);
            }

            /* Enable channel interrupt ID. */
            irqNumber = g_edmaIrqId[i][j];
            INT_SYS_DisableIRQ(irqNumber);
        }

