m-okada/QV08/emu/ARM/kinetis_workspace/t03/SDK/platform/drivers/src/edma/fsl_edma_driver.c
        /* Disable edma clock gate. */
        CLOCK_SYS_DisableDmaClock(i);
    }

    /* Disable dmamux clock gate. */
    for (i = 0; i < DMAMUX_INSTANCE_COUNT; i++)
    {
        CLOCK_SYS_DisableDmamuxClock(i);
    }

#if (USE_RTOS)
    OSA_MutexDestroy(&g_edma->lock);
#endif

    g_edma = NULL;

    return kStatus_EDMA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_InstallCallback
 * Description   : Register callback function and parameter.
 *
 *END**************************************************************************/
edma_status_t EDMA_DRV_InstallCallback(
        edma_chn_state_t *chn, edma_callback_t callback, void *parameter)
{
    chn->callback = callback;
    chn->parameter = parameter;

    return kStatus_EDMA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_RequestChannel
 * Description   : Request an eDMA channel.
 *
 *END**************************************************************************/
uint8_t EDMA_DRV_RequestChannel(
                uint8_t channel, dma_request_source_t source, edma_chn_state_t *chn)
{

    /*Check if dynamically allocation is requested */
    if (channel == kEDMAAnyChannel)
    {
        uint32_t i = 0, j;
        uint32_t map;
        map = ((uint32_t)source >> 8);

        while (map != 0)
        {
            if (map & (1U << i))
            {
                for (j = i * FSL_FEATURE_DMAMUX_MODULE_CHANNEL; j < (i + 1) * FSL_FEATURE_DMAMUX_MODULE_CHANNEL; j++)
                {
                    EDMA_DRV_LOCK();
                    if (!g_edma->chn[j])
                    {
                        g_edma->chn[j] = chn;
                        EDMA_DRV_UNLOCK();
                        EDMA_DRV_ClaimChannel(j, source, chn);
                        return j;
                    }
                    EDMA_DRV_UNLOCK();
                }

            }
            map &= ~(0x1U << i);
            i++;
        }

        /* No available channel. */
        return kEDMAInvalidChannel;
    }

    /* static allocation */
    EDMA_DRV_LOCK();
    if (!g_edma->chn[channel])
    {
        g_edma->chn[channel] = chn;
        EDMA_DRV_UNLOCK();
        EDMA_DRV_ClaimChannel(channel, source, chn);
        return channel;
    }
    EDMA_DRV_UNLOCK();

    return kEDMAInvalidChannel;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_ClaimChannel
 * Description   : Claim an edma channel.
 *
 *END**************************************************************************/
static edma_status_t EDMA_DRV_ClaimChannel(
                uint8_t channel, dma_request_source_t source, edma_chn_state_t *chn)
{
    uint8_t src = (uint32_t)source & 0xFF;
    DMA_Type * edmaRegBase = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(channel);
    uint32_t edmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(channel);
    DMAMUX_Type * dmamuxRegBase = VIRTUAL_CHN_TO_DMAMUX_MODULE_REGBASE(channel);
    uint32_t dmamuxChannel = VIRTUAL_CHN_TO_DMAMUX_CHN(channel);

    /* Reset the channel state structure to default value. */
    memset(chn, 0, sizeof(edma_chn_state_t));

    /* Init the channel state structure to the allocated channel number. */
    chn->channel = channel;

    /* Enable error interrupt for this channel */
    EDMA_HAL_SetErrorIntCmd(edmaRegBase, true, (edma_channel_indicator_t)edmaChannel);

    /* Configure the DMAMUX for edma channel */
    DMAMUX_HAL_SetChannelCmd(dmamuxRegBase, dmamuxChannel, false);
    DMAMUX_HAL_SetTriggerSource(dmamuxRegBase, dmamuxChannel, src%(uint8_t)kDmamuxDmaRequestSource);
    DMAMUX_HAL_SetChannelCmd(dmamuxRegBase, dmamuxChannel, true);

    /* Clear the TCD registers for this channel */
    EDMA_HAL_HTCDClearReg(edmaRegBase, edmaChannel);

    return kStatus_EDMA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_ReleaseChannel
 * Description   : Free eDMA channel's hardware and software resource.
 *
 *END**************************************************************************/
edma_status_t EDMA_DRV_ReleaseChannel(edma_chn_state_t *chn)
{
    uint32_t channel = chn->channel;
    DMA_Type * edmaRegBase = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(channel);
    uint32_t edmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(channel);

    if (!g_edma->chn[channel])
    {
        return kStatus_EDMA_InvalidArgument;
    }

    /* Stop edma channel. */
    EDMA_HAL_SetDmaRequestCmd(edmaRegBase,(edma_channel_indicator_t)edmaChannel, false);

    memset(chn, 0x0, sizeof(edma_chn_state_t));

    EDMA_DRV_LOCK();
    g_edma->chn[channel] = NULL;
    EDMA_DRV_UNLOCK();
    return kStatus_EDMA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_ClearIntStatus
 * Description   : Clear done and interrupt status.
 *
 *END**************************************************************************/
static void EDMA_DRV_ClearIntStatus(uint8_t channel)
{
    DMA_Type * edmaRegBase = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(channel);
    uint32_t edmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(channel);

    EDMA_HAL_ClearDoneStatusFlag(edmaRegBase, (edma_channel_indicator_t)edmaChannel);
    EDMA_HAL_ClearIntStatusFlag(edmaRegBase, (edma_channel_indicator_t)edmaChannel);
}

#if (FSL_FEATURE_EDMA_MODULE_CHANNEL <= 16U)
/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_IRQ_HANDLER
 * Description   : EDMA IRQ handler.
 *
 *END**************************************************************************/
void EDMA_DRV_IRQHandler(uint8_t channel)
{
    edma_chn_state_t *chn = g_edma->chn[channel];

    if (!chn)
    {
        return;
    }

    EDMA_DRV_ClearIntStatus(channel);

