m-okada/QV08/emu/ARM/kinetis_workspace/t03/SDK/platform/drivers/src/edma/fsl_edma_driver.c
    if (chn->callback)
    {
        chn->callback(chn->parameter, chn->status);
    }
}
#else
/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_IRQ_HANDLER
 * Description   : EDMA IRQ handler.This handler is for EDMA module in which
 * 				   channel n share the irq number with channel (n + 16)
 *
 *END**************************************************************************/
void EDMA_DRV_IRQHandler(uint8_t channel)
{
    edma_chn_state_t *chn = g_edma->chn[channel];
    DMA_Type * edmaRegBase = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(channel);
    uint32_t edmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(channel);

    while (channel < 32)
    {
        chn = g_edma->chn[channel];

        if ((chn != NULL) && (EDMA_HAL_GetIntStatusFlag(edmaRegBase, edmaChannel) != 0))
        {
            EDMA_DRV_ClearIntStatus(channel);
            if (chn->callback)
            {
                chn->callback(chn->parameter, chn->status);
            }
        }
        channel += 16;
        edmaRegBase = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(channel);
        edmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(channel);
    }
}
#endif

/*FUNCTION**********************************************************************
 *
 * Function Name : DMA_ERR_IRQHandler
 * Description   : EDMA error handler
 *
 *END**************************************************************************/
void EDMA_DRV_ErrorIRQHandler(uint8_t instance)
{
    uint32_t channel, error, j = 0;
    DMA_Type * edmaRegBase = g_edmaBase[instance];
    edma_chn_state_t *chn;

    error = EDMA_HAL_GetErrorIntStatusFlag(edmaRegBase);

    while (error && (j < FSL_FEATURE_EDMA_MODULE_CHANNEL))
    {
        if (error & 1U)
        {
            channel = instance * FSL_FEATURE_EDMA_MODULE_CHANNEL + j;
            EDMA_HAL_SetDmaRequestCmd(edmaRegBase, (edma_channel_indicator_t)j, false);
            chn = g_edma->chn[channel];
            if (chn)
            {
                EDMA_DRV_ClearIntStatus(channel);
                chn->status = kEDMAChnError;
                if (chn->callback)
                {
                    chn->callback(chn->parameter, chn->status);
                }
            }
        }
        error = error >> 1U;
        j++;
    }
    EDMA_HAL_SetHaltCmd(edmaRegBase, false);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_ConfigLoopTransfer
 * Description   : Configures the DMA transfer in a loop.
 *
 *END**************************************************************************/
edma_status_t EDMA_DRV_ConfigLoopTransfer(
                            edma_chn_state_t *chn, edma_software_tcd_t *stcd,
                            edma_transfer_type_t type,
                            uint32_t srcAddr, uint32_t destAddr, uint32_t size,
                            uint32_t bytesOnEachRequest, uint32_t totalLength, uint8_t number)
{
    assert(stcd);

    uint8_t i;
    edma_software_tcd_t *stcdAddr = (edma_software_tcd_t *)STCD_ADDR(stcd);
    edma_transfer_size_t transfersize;
    edma_transfer_config_t config;

    /* Set the software TCD memory to default value. */
    memset(stcdAddr, 0, number * sizeof(edma_software_tcd_t));

    /* translate the transfer size to eDMA allowed transfer size enum type. */
    switch(size)
    {
        case 1:
            transfersize = kEDMATransferSize_1Bytes;
            break;
        case 2:
            transfersize = kEDMATransferSize_2Bytes;
            break;
        case 4:
            transfersize = kEDMATransferSize_4Bytes;
            break;
        case 16:
            transfersize = kEDMATransferSize_16Bytes;
            break;
        case 32:
            transfersize = kEDMATransferSize_32Bytes;
            break;
        default:
            return kStatus_EDMA_InvalidArgument;
    }

    /* Configure the software TCD one by one.*/
    config.srcLastAddrAdjust = 0;
    config.destLastAddrAdjust = 0;
    config.srcModulo = kEDMAModuloDisable;
    config.destModulo = kEDMAModuloDisable;
    config.srcTransferSize = transfersize;
    config.destTransferSize = transfersize;
    config.minorLoopCount = bytesOnEachRequest;
    config.majorLoopCount = totalLength / (bytesOnEachRequest * number);
    for(i = 0; i < number; i++)
    {
        switch (type)
        {
            case kEDMAPeripheralToMemory:
                /* Configure Source Read. */
                config.srcAddr = srcAddr;
                config.srcOffset = 0;

                /* Configure Dest Write. */
                config.destAddr = destAddr + i * (totalLength/number);
                config.destOffset = size;
                break;
            case kEDMAMemoryToPeripheral:
                /* Configure Source Read. */
                config.srcAddr = srcAddr + i * (totalLength/number);
                config.srcOffset = size;

                /* Configure Dest Write. */
                config.destAddr = destAddr;
                config.destOffset = 0;
                break;
            case kEDMAMemoryToMemory:
                /* Configure Source Read. */
                config.srcAddr = srcAddr + i * (totalLength/number);
                config.srcOffset = size;

                /* Configure Dest Write. */
                config.destAddr = destAddr + i * (totalLength/number);
                config.destOffset = size;
                break;
            default:
                return kStatus_EDMA_InvalidArgument;
        }

        EDMA_DRV_PrepareDescriptorTransfer(chn, &stcdAddr[i], &config, true, false);
        EDMA_DRV_PrepareDescriptorScatterGather(&stcdAddr[i], &stcdAddr[(i+1)%number]);
    }

    EDMA_DRV_PushDescriptorToReg(chn, &stcdAddr[0]);

    return kStatus_EDMA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_ConfigScatterGatherTransfer
 * Description   : User friendly interface to configure single end descritptor chain.
 *
 *END**************************************************************************/
edma_status_t EDMA_DRV_ConfigScatterGatherTransfer(
                        edma_chn_state_t *chn, edma_software_tcd_t *stcd,
                        edma_transfer_type_t type,
                        uint32_t size, uint32_t bytesOnEachRequest,
                        edma_scatter_gather_list_t *srcList, edma_scatter_gather_list_t *destList,
                        uint8_t number)
{
    assert(stcd);
    uint8_t i;
    edma_transfer_size_t transfersize;
    edma_software_tcd_t *stcdAddr = (edma_software_tcd_t *)STCD_ADDR(stcd);
    edma_transfer_config_t config;

