m-okada/QV08/emu/ARM/kinetis_workspace/t03/SDK/platform/drivers/src/edma/fsl_edma_driver.c
    if (number > 1)
    {
        memset(stcdAddr, 0, number * sizeof(edma_software_tcd_t));
    }

    switch(size)
    {
        case 1:
            transfersize = kEDMATransferSize_1Bytes;
            break;
        case 2:
            transfersize = kEDMATransferSize_2Bytes;
            break;
        case 4:
            transfersize = kEDMATransferSize_4Bytes;
            break;
        case 16:
            transfersize = kEDMATransferSize_16Bytes;
            break;
        case 32:
            transfersize = kEDMATransferSize_32Bytes;
            break;
        default:
            return kStatus_EDMA_InvalidArgument;
    }


    /* Configure the software TCD one by one.*/
    config.srcLastAddrAdjust = 0;
    config.destLastAddrAdjust = 0;
    config.srcModulo = kEDMAModuloDisable;
    config.destModulo = kEDMAModuloDisable;
    config.srcTransferSize = transfersize;
    config.destTransferSize = transfersize;
    config.minorLoopCount = bytesOnEachRequest;

    for (i = 0; i < number; i++)
    {
        config.srcAddr = srcList[i].address;
        config.destAddr = destList[i].address;
        if (srcList[i].length != destList[i].length)
        {
            return kStatus_EDMA_InvalidArgument;
        }
        config.majorLoopCount = srcList[i].length/bytesOnEachRequest;

        switch (type)
        {
            case kEDMAPeripheralToMemory:
                /* Configure Source Read. */
                config.srcOffset = 0;

                /* Configure Dest Write. */
                config.destOffset = size;
                break;
            case kEDMAMemoryToPeripheral:
                /* Configure Source Read. */
                config.srcOffset = size;

                /* Configure Dest Write. */
                config.destOffset = 0;
                break;
            case kEDMAMemoryToMemory:
                /* Configure Source Read. */
                config.srcOffset = size;

                /* Configure Dest Write. */
                config.destOffset = size;
                break;
            default:
                return kStatus_EDMA_InvalidArgument;
        }

        if (number == 1)
        {
            /* If only one TCD is required, only hardware TCD is required and user
             * is not required to prepare the software TCD memory. */
            edma_software_tcd_t temp[2];
            edma_software_tcd_t *tempTCD = STCD_ADDR(temp);
            memset((void*) tempTCD,0, sizeof(edma_software_tcd_t));
            EDMA_DRV_PrepareDescriptorTransfer(chn, tempTCD, &config, true, true);
            EDMA_DRV_PushDescriptorToReg(chn, tempTCD);
        }
        else if (i == (number - 1))
        {
            EDMA_DRV_PrepareDescriptorTransfer(chn, &stcdAddr[i], &config, true, true);
            EDMA_DRV_PushDescriptorToReg(chn, &stcdAddr[0]);
        }
        else
        {
            EDMA_DRV_PrepareDescriptorTransfer(chn, &stcdAddr[i], &config, false, false);
            EDMA_DRV_PrepareDescriptorScatterGather(&stcdAddr[i], &stcdAddr[i+1]);
        }
    }

    return kStatus_EDMA_Success;

}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_StartChannel
 * Description   : Starts an eDMA channel.
 *
 *END**************************************************************************/
edma_status_t EDMA_DRV_StartChannel(edma_chn_state_t *chn)
{
    uint32_t channel = chn->channel;
    DMA_Type * edmaRegBase = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(channel);
    uint32_t edmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(channel);

    EDMA_HAL_SetDmaRequestCmd(edmaRegBase,(edma_channel_indicator_t)edmaChannel,true);

    return kStatus_EDMA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_StopChannel
 * Description   : Stops an eDMA channel.
 *
 *END**************************************************************************/
edma_status_t EDMA_DRV_StopChannel(edma_chn_state_t *chn)
{
    uint32_t channel = chn->channel;
    DMA_Type * edmaRegBase = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(channel);
    uint32_t edmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(channel);

    EDMA_HAL_SetDmaRequestCmd(edmaRegBase,(edma_channel_indicator_t)edmaChannel, false);

    return kStatus_EDMA_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : EDMA_DRV_PushDescriptorToReg
 * Description   : Copy the software TCD configuration to the hardware TCD.
 *
 *END**************************************************************************/
edma_status_t EDMA_DRV_PushDescriptorToReg(edma_chn_state_t *chn, edma_software_tcd_t *stcd)
{
    uint32_t channel = chn->channel;
    DMA_Type * edmaRegBase = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(channel);
    uint32_t edmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(channel);

    EDMA_HAL_HTCDClearReg(edmaRegBase, edmaChannel);
    EDMA_HAL_PushSTCDToHTCD(edmaRegBase, edmaChannel, stcd);

    return kStatus_EDMA_Success;
}
#endif

/*******************************************************************************
 * EOF
 ******************************************************************************/

